tinaho94/miniTron/libraries/SparkFun_ESP8266_AT_Arduino_Library/src/SparkFunESP8266WiFi.cpp
				size_t octetLength = strspn(p, "0123456789"); // Find length of numerical string:
				if (octetLength >= 4) // If it's too big, return an error
					return ESP8266_RSP_UNKNOWN;
				
				strncpy(tempOctet, p, octetLength); // Copy string to temp char array:
				returnIP[i] = atoi(tempOctet); // Move the temp char into IP Address octet
				
				p += (octetLength + 1); // Increment p to next octet
			}
			
			return returnIP;
		}
	}
	
	return rsp;
}

int16_t ESP8266Class::localMAC(char * mac)
{
	sendCommand(ESP8266_GET_STA_MAC, ESP8266_CMD_QUERY); // Send "AT+CIPSTAMAC?"

	int16_t rsp = readForResponse(RESPONSE_OK, 2000); //COMMAND_RESPONSE_TIMEOUT);

	if (rsp > 0)
	{
		// Look for "+CIPSTAMAC"
		char * p = strstr(esp8266RxBuffer, ESP8266_GET_STA_MAC);
		if (p != NULL)
		{
			p += strlen(ESP8266_GET_STA_MAC) + 2;
			char * q = strchr(p, '"');
			if (q == NULL) return ESP8266_RSP_UNKNOWN;
			strncpy(mac, p, q - p); // Copy string to temp char array:
			return 1;
		}
	}

	return rsp;
}

int16_t ESP8266Class::getSoftAPMAC(char* mac) {

	sendCommand(ESP8266_AP_MAC, ESP8266_CMD_QUERY);
	int16_t rsp = readForResponse(RESPONSE_OK, 2000);

	if(rsp > 0) {
		// Look for +CIPAPMAC
		char* p = strstr(esp8266RxBuffer, ESP8266_AP_MAC);
		if(p != NULL) {
			p += strlen(ESP8266_AP_MAC) + 2;
			char* q = strchr(p, '"');
			if(q == NULL) return ESP8266_RSP_UNKNOWN;
			strncpy(mac, p, q - p);
			return 1;
		}
	}
	return rsp;
}

/////////////////////
// TCP/IP Commands //
/////////////////////

int16_t ESP8266Class::tcpConnect(uint8_t linkID, const char * destination, uint16_t port, uint16_t keepAlive)
{
	print("AT");
	print(ESP8266_TCP_CONNECT);
	print('=');
	print(linkID);
	print(',');
	print("\"TCP\",");
	print("\"");
	print(destination);
	print("\",");
	print(port);
	if (keepAlive > 0)
	{
		print(',');
		// keepAlive is in units of 500 milliseconds.
		// Max is 7200 * 500 = 3600000 ms = 60 minutes.
		print(keepAlive / 500);
	}
	print("\r\n");
	// Example good: CONNECT\r\n\r\nOK\r\n
	// Example bad: DNS Fail\r\n\r\nERROR\r\n
	// Example meh: ALREADY CONNECTED\r\n\r\nERROR\r\n
	int16_t rsp = readForResponses(RESPONSE_OK, RESPONSE_ERROR, CLIENT_CONNECT_TIMEOUT);
	
	if (rsp < 0)
	{
		// We may see "ERROR", but be "ALREADY CONNECTED".
		// Search for "ALREADY", and return success if we see it.
		char * p = searchBuffer("ALREADY");
		if (p != NULL)
			return 2;
		// Otherwise the connection failed. Return the error code:
		return rsp;
	}
	// Return 1 on successful (new) connection
	return 1;
}

int16_t ESP8266Class::tcpSend(uint8_t linkID, const uint8_t *buf, size_t size)
{
	if (size > 2048)
		return ESP8266_CMD_BAD;
	char params[8];
	sprintf(params, "%d,%d", linkID, size);
	sendCommand(ESP8266_TCP_SEND, ESP8266_CMD_SETUP, params);
	
	int16_t rsp = readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT);
	//if (rsp > 0)
	if (rsp != ESP8266_RSP_FAIL)
	{
		print((const char *)buf);
		
		rsp = readForResponse("SEND OK", COMMAND_RESPONSE_TIMEOUT);
		
		if (rsp > 0)
			return size;
	}
	
	return rsp;
}

int16_t ESP8266Class::close(uint8_t linkID)
{
	char params[2];
	sprintf(params, "%d", linkID);
	sendCommand(ESP8266_TCP_CLOSE, ESP8266_CMD_SETUP, params);
	
	// Eh, client virtual function doesn't have a return value.
	// We'll wait for the OK or timeout anyway.
	//return readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT);
	return readForResponses(RESPONSE_OK, RESPONSE_ERROR, 5000);
}

int16_t ESP8266Class::setTransferMode(uint8_t mode)
{
	char params[2] = {0, 0};
	params[0] = (mode > 0) ? '1' : '0';
	sendCommand(ESP8266_TRANSMISSION_MODE, ESP8266_CMD_SETUP, params);
	
	return readForResponse(RESPONSE_OK, COMMAND_RESPONSE_TIMEOUT);
}

int16_t ESP8266Class::setMux(uint8_t mux)
{
	char params[2] = {0, 0};
	params[0] = (mux > 0) ? '1' : '0';
	sendCommand(ESP8266_TCP_MULTIPLE, ESP8266_CMD_SETUP, params);
	
	return readForResponse(RESPONSE_OK, COMMAND_RESPONSE_TIMEOUT);
}

int16_t ESP8266Class::configureTCPServer(uint16_t port, uint8_t create)
{
	char params[10];
	if (create > 1) create = 1;
	sprintf(params, "%d,%d", create, port);
	sendCommand(ESP8266_SERVER_CONFIG, ESP8266_CMD_SETUP, params);

	// _serial->print("AT");
	// _serial->print(ESP8266_SERVER_CONFIG);
	// _serial->print("=\"");
	// _serial->print(1);
	// _serial->print("\"");
	// _serial->print(',');
	// _serial->print("\"");
	// _serial->print(80);
	// _serial->print("\"");
	// _serial->print("\r\n");


	
	return readForResponse(RESPONSE_OK, COMMAND_RESPONSE_TIMEOUT);	
}

int16_t ESP8266Class::ping(IPAddress ip)
{
	char ipStr[17];
	sprintf(ipStr, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
	return ping(ipStr);
}

int16_t ESP8266Class::ping(char * server)
{
	char params[strlen(server) + 3];
	sprintf(params, "\"%s\"", server);
	// Send AT+Ping=<server>
	sendCommand(ESP8266_PING, ESP8266_CMD_SETUP, params); 
	// Example responses:
	//  * Good response: +12\r\n\r\nOK\r\n
	//  * Timeout response: +timeout\r\n\r\nERROR\r\n
	//  * Error response (unreachable): ERROR\r\n\r\n
	int16_t rsp = readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_PING_TIMEOUT);
	if (rsp > 0)
	{
		char * p = searchBuffer("+");
		p += 1; // Move p forward 1 space
		char * q = strchr(p, '\r'); // Find the first \r
		if (q == NULL)
			return ESP8266_RSP_UNKNOWN;
		char tempRsp[10];
		strncpy(tempRsp, p, q - p);
		return atoi(tempRsp);
	}
	else
	{
		if (searchBuffer("timeout") != NULL)
			return 0;
	}
	
	return rsp;
}

//////////////////////////
// Custom GPIO Commands //
//////////////////////////
int16_t ESP8266Class::pinMode(uint8_t pin, uint8_t mode)
{
	char params[5];
	
	char modeC = 'i'; // Default mode to input
	if (mode == OUTPUT) 
		modeC = 'o'; // o = OUTPUT
	else if (mode == INPUT_PULLUP) 
		modeC = 'p'; // p = INPUT_PULLUP
	
	sprintf(params, "%d,%c", pin, modeC);
	sendCommand(ESP8266_PINMODE, ESP8266_CMD_SETUP, params);
	
	return readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT);
}

int16_t ESP8266Class::digitalWrite(uint8_t pin, uint8_t state)
{
	char params[5];
	
