tinaho94/miniTron/libraries/SparkFun_ESP8266_AT_Arduino_Library/src/SparkFunESP8266WiFi.cpp
	char stateC = 'l'; // Default state to LOW
	if (state == HIGH) 
		stateC = 'h'; // h = HIGH
	
	sprintf(params, "%d,%c", pin, stateC);
	sendCommand(ESP8266_PINWRITE, ESP8266_CMD_SETUP, params);
	
	return readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT);
}

int8_t ESP8266Class::digitalRead(uint8_t pin)
{
	char params[3];
	
	sprintf(params, "%d", pin);
	sendCommand(ESP8266_PINREAD, ESP8266_CMD_SETUP, params); // Send AT+PINREAD=n\r\n
	// Example response: 1\r\n\r\nOK\r\n
	if (readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT) > 0)
	{
		if (strchr(esp8266RxBuffer, '0') != NULL)
			return LOW;
		else if (strchr(esp8266RxBuffer, '1') != NULL)
			return HIGH;
	}
	
	return -1;
}

//////////////////////////////
// Stream Virtual Functions //
//////////////////////////////

size_t ESP8266Class::write(uint8_t c)
{
	_serial->write(c);
}

int ESP8266Class::available()
{
	return _serial->available();
}

int ESP8266Class::read()
{
	return _serial->read();
}

int ESP8266Class::peek()
{
	return _serial->peek();
}

void ESP8266Class::flush()
{
	_serial->flush();
}

//////////////////////////////////////////////////
// Private, Low-Level, Ugly, Hardware Functions //
//////////////////////////////////////////////////

void ESP8266Class::sendCommand(const char * cmd, enum esp8266_command_type type, const char * params)
{
	_serial->print("AT");
	_serial->print(cmd);
	if (type == ESP8266_CMD_QUERY)
		_serial->print('?');
	else if (type == ESP8266_CMD_SETUP)
	{
		_serial->print("=");
		_serial->print(params);		
	}
	_serial->print("\r\n");
}

int16_t ESP8266Class::readForResponse(const char * rsp, unsigned int timeout)
{
	unsigned long timeIn = millis();	// Timestamp coming into function
	unsigned int received = 0; // received keeps track of number of chars read
	
	clearBuffer();	// Clear the class receive buffer (esp8266RxBuffer)
	while (timeIn + timeout > millis()) // While we haven't timed out
	{
		int n;
		if (n = _serial->available()) // If data is available on UART RX
		{
			int i;
			for(i=0;i<n;i++)
			{
				// Read the data in
				char c = _serial->read();
				// Store the data in the buffer
				esp8266RxBuffer[bufferHead] = c;
				//! TODO: Don't care if we overflow. Should we? Set a flag or something?
				bufferHead = (bufferHead + 1) % ESP8266_RX_BUFFER_LEN;

				if (searchBuffer(rsp))	// Search the buffer for goodRsp
				{
					esp8266RxBuffer[bufferHead] = '\0';
					//Serial.print(esp8266RxBuffer);
					return received;	// Return how number of chars read
				}
			}
			received += n;
			//received += readByteToBuffer();
		}
		else
			delayMicroseconds(100);
			//delay(1);
	}
	
	if (received > 0) // If we received any characters
	{
		esp8266RxBuffer[bufferHead] = '\0';
		//Serial.print(esp8266RxBuffer);
		return ESP8266_RSP_UNKNOWN; // Return unkown response error code
	}
	else // If we haven't received any characters
	{
		esp8266RxBuffer[bufferHead] = '\0';
		//Serial.print(esp8266RxBuffer);
		return ESP8266_RSP_TIMEOUT; // Return the timeout error code
	}
}

int16_t ESP8266Class::readForResponses(const char * pass, const char * fail, unsigned int timeout)
{
	unsigned long timeIn = millis();	// Timestamp coming into function
	unsigned int received = 0; // received keeps track of number of chars read
	
	clearBuffer();	// Clear the class receive buffer (esp8266RxBuffer)
	while (timeIn + timeout > millis()) // While we haven't timed out
	{
		int n;
		if (n = _serial->available()) // If data is available on UART RX
		{
			int i;
			for(i=0;i<n;i++)
			{
				// Read the data in
				char c = _serial->read();
				// Store the data in the buffer
				esp8266RxBuffer[bufferHead] = c;
				//! TODO: Don't care if we overflow. Should we? Set a flag or something?
				bufferHead = (bufferHead + 1) % ESP8266_RX_BUFFER_LEN;
				if (searchBuffer(pass))	// Search the buffer for goodRsp
				{
					esp8266RxBuffer[bufferHead] = '\0';
					//Serial.print(esp8266RxBuffer);
					return received;	// Return how number of chars read
				}
				if (searchBuffer(fail))
				{
					esp8266RxBuffer[bufferHead] = '\0';
					//Serial.print(esp8266RxBuffer);
					return ESP8266_RSP_FAIL;
				}
			}
			received += n;			
		    //received += readByteToBuffer();
		}
		else
			delayMicroseconds(100);
			//delay(1);
	}
	
	if (received > 0) // If we received any characters
	{
		esp8266RxBuffer[bufferHead] = '\0';
		//Serial.print(esp8266RxBuffer);
		return ESP8266_RSP_UNKNOWN; // Return unkown response error code
	}
	else // If we haven't received any characters
	{
		esp8266RxBuffer[bufferHead] = '\0';
		//Serial.print(esp8266RxBuffer);
		return ESP8266_RSP_TIMEOUT; // Return the timeout error code
	}
}

//////////////////
// Buffer Stuff //
//////////////////
void ESP8266Class::clearBuffer()
{
	memset(esp8266RxBuffer, '\0', ESP8266_RX_BUFFER_LEN);
	bufferHead = 0;
}	

unsigned int ESP8266Class::readByteToBuffer()
{
	// Read the data in
	char c = _serial->read();
	
	// Store the data in the buffer
	esp8266RxBuffer[bufferHead] = c;
	//! TODO: Don't care if we overflow. Should we? Set a flag or something?
	bufferHead = (bufferHead + 1) % ESP8266_RX_BUFFER_LEN;
	
	return 1;
}

char * ESP8266Class::searchBuffer(const char * test)
{
	int bufferLen = strlen((const char *)esp8266RxBuffer);
	int testLen = strlen((const char *)esp8266RxBuffer);

	// If our buffer isn't full, just do an strstr
	if (bufferLen < ESP8266_RX_BUFFER_LEN && bufferLen >= testLen)
		return strstr((const char *)esp8266RxBuffer, test);
	else
		return 0;
/*
	else
	{	//! TODO
		// If the buffer is full, we need to search from the end of the 
		// buffer back to the beginning.
		int testLen = strlen(test);
		for (int i=0; i<ESP8266_RX_BUFFER_LEN; i++)
		{
			
		}
	}
	*/
}

ESP8266Class esp8266;
